zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_BCTU.h
#define BCTU_SFTRGR2_SFTRG36_MASK                (0x10U)
#define BCTU_SFTRGR2_SFTRG36_SHIFT               (4U)
#define BCTU_SFTRGR2_SFTRG36_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG36(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG36_SHIFT)) & BCTU_SFTRGR2_SFTRG36_MASK)

#define BCTU_SFTRGR2_SFTRG37_MASK                (0x20U)
#define BCTU_SFTRGR2_SFTRG37_SHIFT               (5U)
#define BCTU_SFTRGR2_SFTRG37_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG37(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG37_SHIFT)) & BCTU_SFTRGR2_SFTRG37_MASK)

#define BCTU_SFTRGR2_SFTRG38_MASK                (0x40U)
#define BCTU_SFTRGR2_SFTRG38_SHIFT               (6U)
#define BCTU_SFTRGR2_SFTRG38_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG38(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG38_SHIFT)) & BCTU_SFTRGR2_SFTRG38_MASK)

#define BCTU_SFTRGR2_SFTRG39_MASK                (0x80U)
#define BCTU_SFTRGR2_SFTRG39_SHIFT               (7U)
#define BCTU_SFTRGR2_SFTRG39_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG39(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG39_SHIFT)) & BCTU_SFTRGR2_SFTRG39_MASK)

#define BCTU_SFTRGR2_SFTRG40_MASK                (0x100U)
#define BCTU_SFTRGR2_SFTRG40_SHIFT               (8U)
#define BCTU_SFTRGR2_SFTRG40_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG40(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG40_SHIFT)) & BCTU_SFTRGR2_SFTRG40_MASK)

#define BCTU_SFTRGR2_SFTRG41_MASK                (0x200U)
#define BCTU_SFTRGR2_SFTRG41_SHIFT               (9U)
#define BCTU_SFTRGR2_SFTRG41_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG41(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG41_SHIFT)) & BCTU_SFTRGR2_SFTRG41_MASK)

#define BCTU_SFTRGR2_SFTRG42_MASK                (0x400U)
#define BCTU_SFTRGR2_SFTRG42_SHIFT               (10U)
#define BCTU_SFTRGR2_SFTRG42_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG42(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG42_SHIFT)) & BCTU_SFTRGR2_SFTRG42_MASK)

#define BCTU_SFTRGR2_SFTRG43_MASK                (0x800U)
#define BCTU_SFTRGR2_SFTRG43_SHIFT               (11U)
#define BCTU_SFTRGR2_SFTRG43_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG43(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG43_SHIFT)) & BCTU_SFTRGR2_SFTRG43_MASK)

#define BCTU_SFTRGR2_SFTRG44_MASK                (0x1000U)
#define BCTU_SFTRGR2_SFTRG44_SHIFT               (12U)
#define BCTU_SFTRGR2_SFTRG44_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG44(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG44_SHIFT)) & BCTU_SFTRGR2_SFTRG44_MASK)

#define BCTU_SFTRGR2_SFTRG45_MASK                (0x2000U)
#define BCTU_SFTRGR2_SFTRG45_SHIFT               (13U)
#define BCTU_SFTRGR2_SFTRG45_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG45(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG45_SHIFT)) & BCTU_SFTRGR2_SFTRG45_MASK)

#define BCTU_SFTRGR2_SFTRG46_MASK                (0x4000U)
#define BCTU_SFTRGR2_SFTRG46_SHIFT               (14U)
#define BCTU_SFTRGR2_SFTRG46_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG46(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG46_SHIFT)) & BCTU_SFTRGR2_SFTRG46_MASK)

#define BCTU_SFTRGR2_SFTRG47_MASK                (0x8000U)
#define BCTU_SFTRGR2_SFTRG47_SHIFT               (15U)
#define BCTU_SFTRGR2_SFTRG47_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG47(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG47_SHIFT)) & BCTU_SFTRGR2_SFTRG47_MASK)

#define BCTU_SFTRGR2_SFTRG48_MASK                (0x10000U)
#define BCTU_SFTRGR2_SFTRG48_SHIFT               (16U)
#define BCTU_SFTRGR2_SFTRG48_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG48(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG48_SHIFT)) & BCTU_SFTRGR2_SFTRG48_MASK)

#define BCTU_SFTRGR2_SFTRG49_MASK                (0x20000U)
#define BCTU_SFTRGR2_SFTRG49_SHIFT               (17U)
#define BCTU_SFTRGR2_SFTRG49_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG49(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG49_SHIFT)) & BCTU_SFTRGR2_SFTRG49_MASK)

#define BCTU_SFTRGR2_SFTRG50_MASK                (0x40000U)
#define BCTU_SFTRGR2_SFTRG50_SHIFT               (18U)
#define BCTU_SFTRGR2_SFTRG50_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG50(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG50_SHIFT)) & BCTU_SFTRGR2_SFTRG50_MASK)

#define BCTU_SFTRGR2_SFTRG51_MASK                (0x80000U)
#define BCTU_SFTRGR2_SFTRG51_SHIFT               (19U)
#define BCTU_SFTRGR2_SFTRG51_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG51(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG51_SHIFT)) & BCTU_SFTRGR2_SFTRG51_MASK)

#define BCTU_SFTRGR2_SFTRG52_MASK                (0x100000U)
#define BCTU_SFTRGR2_SFTRG52_SHIFT               (20U)
#define BCTU_SFTRGR2_SFTRG52_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG52(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG52_SHIFT)) & BCTU_SFTRGR2_SFTRG52_MASK)

#define BCTU_SFTRGR2_SFTRG53_MASK                (0x200000U)
#define BCTU_SFTRGR2_SFTRG53_SHIFT               (21U)
#define BCTU_SFTRGR2_SFTRG53_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG53(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG53_SHIFT)) & BCTU_SFTRGR2_SFTRG53_MASK)

#define BCTU_SFTRGR2_SFTRG54_MASK                (0x400000U)
#define BCTU_SFTRGR2_SFTRG54_SHIFT               (22U)
#define BCTU_SFTRGR2_SFTRG54_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG54(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG54_SHIFT)) & BCTU_SFTRGR2_SFTRG54_MASK)

#define BCTU_SFTRGR2_SFTRG55_MASK                (0x800000U)
#define BCTU_SFTRGR2_SFTRG55_SHIFT               (23U)
#define BCTU_SFTRGR2_SFTRG55_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG55(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG55_SHIFT)) & BCTU_SFTRGR2_SFTRG55_MASK)

#define BCTU_SFTRGR2_SFTRG56_MASK                (0x1000000U)
#define BCTU_SFTRGR2_SFTRG56_SHIFT               (24U)
#define BCTU_SFTRGR2_SFTRG56_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG56(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG56_SHIFT)) & BCTU_SFTRGR2_SFTRG56_MASK)

#define BCTU_SFTRGR2_SFTRG57_MASK                (0x2000000U)
#define BCTU_SFTRGR2_SFTRG57_SHIFT               (25U)
#define BCTU_SFTRGR2_SFTRG57_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG57(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG57_SHIFT)) & BCTU_SFTRGR2_SFTRG57_MASK)

