zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_BCTU.h
#define BCTU_LISTCHR_ADC_CHL_y_plus_1_MASK       (0x7FU)
#define BCTU_LISTCHR_ADC_CHL_y_plus_1_SHIFT      (0U)
#define BCTU_LISTCHR_ADC_CHL_y_plus_1_WIDTH      (7U)
#define BCTU_LISTCHR_ADC_CHL_y_plus_1(x)         (((uint32_t)(((uint32_t)(x)) << BCTU_LISTCHR_ADC_CHL_y_plus_1_SHIFT)) & BCTU_LISTCHR_ADC_CHL_y_plus_1_MASK)

#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_plus_1_MASK (0x4000U)
#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_plus_1_SHIFT (14U)
#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_plus_1_WIDTH (1U)
#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_plus_1(x) (((uint32_t)(((uint32_t)(x)) << BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_plus_1_SHIFT)) & BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_plus_1_MASK)

#define BCTU_LISTCHR_LAST_y_plus_1_MASK          (0x8000U)
#define BCTU_LISTCHR_LAST_y_plus_1_SHIFT         (15U)
#define BCTU_LISTCHR_LAST_y_plus_1_WIDTH         (1U)
#define BCTU_LISTCHR_LAST_y_plus_1(x)            (((uint32_t)(((uint32_t)(x)) << BCTU_LISTCHR_LAST_y_plus_1_SHIFT)) & BCTU_LISTCHR_LAST_y_plus_1_MASK)

#define BCTU_LISTCHR_ADC_CH_y_MASK               (0x7F0000U)
#define BCTU_LISTCHR_ADC_CH_y_SHIFT              (16U)
#define BCTU_LISTCHR_ADC_CH_y_WIDTH              (7U)
#define BCTU_LISTCHR_ADC_CH_y(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_LISTCHR_ADC_CH_y_SHIFT)) & BCTU_LISTCHR_ADC_CH_y_MASK)

#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_MASK (0x40000000U)
#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_SHIFT (30U)
#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_WIDTH (1U)
#define BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y(x)   (((uint32_t)(((uint32_t)(x)) << BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_SHIFT)) & BCTU_LISTCHR_NEXT_CH_WAIT_ON_TRIG_y_MASK)

#define BCTU_LISTCHR_LAST_y_MASK                 (0x80000000U)
#define BCTU_LISTCHR_LAST_y_SHIFT                (31U)
#define BCTU_LISTCHR_LAST_y_WIDTH                (1U)
#define BCTU_LISTCHR_LAST_y(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_LISTCHR_LAST_y_SHIFT)) & BCTU_LISTCHR_LAST_y_MASK)
/*! @} */

/*! @name FIFO1DR - FIFO Result Data */
/*! @{ */

#define BCTU_FIFO1DR_ADC_DATA_MASK               (0x7FFFU)
#define BCTU_FIFO1DR_ADC_DATA_SHIFT              (0U)
#define BCTU_FIFO1DR_ADC_DATA_WIDTH              (15U)
#define BCTU_FIFO1DR_ADC_DATA(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO1DR_ADC_DATA_SHIFT)) & BCTU_FIFO1DR_ADC_DATA_MASK)

#define BCTU_FIFO1DR_ADC_NUM_MASK                (0x30000U)
#define BCTU_FIFO1DR_ADC_NUM_SHIFT               (16U)
#define BCTU_FIFO1DR_ADC_NUM_WIDTH               (2U)
#define BCTU_FIFO1DR_ADC_NUM(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO1DR_ADC_NUM_SHIFT)) & BCTU_FIFO1DR_ADC_NUM_MASK)

#define BCTU_FIFO1DR_CH_MASK                     (0x1FC0000U)
#define BCTU_FIFO1DR_CH_SHIFT                    (18U)
#define BCTU_FIFO1DR_CH_WIDTH                    (7U)
#define BCTU_FIFO1DR_CH(x)                       (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO1DR_CH_SHIFT)) & BCTU_FIFO1DR_CH_MASK)

#define BCTU_FIFO1DR_TRG_SRC_MASK                (0xFE000000U)
#define BCTU_FIFO1DR_TRG_SRC_SHIFT               (25U)
#define BCTU_FIFO1DR_TRG_SRC_WIDTH               (7U)
#define BCTU_FIFO1DR_TRG_SRC(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO1DR_TRG_SRC_SHIFT)) & BCTU_FIFO1DR_TRG_SRC_MASK)
/*! @} */

/*! @name FIFO2DR - FIFO Result Data */
/*! @{ */

#define BCTU_FIFO2DR_ADC_DATA_MASK               (0x7FFFU)
#define BCTU_FIFO2DR_ADC_DATA_SHIFT              (0U)
#define BCTU_FIFO2DR_ADC_DATA_WIDTH              (15U)
#define BCTU_FIFO2DR_ADC_DATA(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO2DR_ADC_DATA_SHIFT)) & BCTU_FIFO2DR_ADC_DATA_MASK)

#define BCTU_FIFO2DR_ADC_NUM_MASK                (0x30000U)
#define BCTU_FIFO2DR_ADC_NUM_SHIFT               (16U)
#define BCTU_FIFO2DR_ADC_NUM_WIDTH               (2U)
#define BCTU_FIFO2DR_ADC_NUM(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO2DR_ADC_NUM_SHIFT)) & BCTU_FIFO2DR_ADC_NUM_MASK)

#define BCTU_FIFO2DR_CH_MASK                     (0x1FC0000U)
#define BCTU_FIFO2DR_CH_SHIFT                    (18U)
#define BCTU_FIFO2DR_CH_WIDTH                    (7U)
#define BCTU_FIFO2DR_CH(x)                       (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO2DR_CH_SHIFT)) & BCTU_FIFO2DR_CH_MASK)

#define BCTU_FIFO2DR_TRG_SRC_MASK                (0xFE000000U)
#define BCTU_FIFO2DR_TRG_SRC_SHIFT               (25U)
#define BCTU_FIFO2DR_TRG_SRC_WIDTH               (7U)
#define BCTU_FIFO2DR_TRG_SRC(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_FIFO2DR_TRG_SRC_SHIFT)) & BCTU_FIFO2DR_TRG_SRC_MASK)
/*! @} */

/*! @name FIFOCR - FIFO Control */
/*! @{ */

#define BCTU_FIFOCR_IEN_FIFO1_MASK               (0x10000U)
#define BCTU_FIFOCR_IEN_FIFO1_SHIFT              (16U)
#define BCTU_FIFOCR_IEN_FIFO1_WIDTH              (1U)
#define BCTU_FIFOCR_IEN_FIFO1(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOCR_IEN_FIFO1_SHIFT)) & BCTU_FIFOCR_IEN_FIFO1_MASK)

#define BCTU_FIFOCR_IEN_FIFO2_MASK               (0x20000U)
#define BCTU_FIFOCR_IEN_FIFO2_SHIFT              (17U)
#define BCTU_FIFOCR_IEN_FIFO2_WIDTH              (1U)
#define BCTU_FIFOCR_IEN_FIFO2(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOCR_IEN_FIFO2_SHIFT)) & BCTU_FIFOCR_IEN_FIFO2_MASK)

#define BCTU_FIFOCR_DMA_EN_FIFO1_MASK            (0x1000000U)
#define BCTU_FIFOCR_DMA_EN_FIFO1_SHIFT           (24U)
#define BCTU_FIFOCR_DMA_EN_FIFO1_WIDTH           (1U)
#define BCTU_FIFOCR_DMA_EN_FIFO1(x)              (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOCR_DMA_EN_FIFO1_SHIFT)) & BCTU_FIFOCR_DMA_EN_FIFO1_MASK)

#define BCTU_FIFOCR_DMA_EN_FIFO2_MASK            (0x2000000U)
#define BCTU_FIFOCR_DMA_EN_FIFO2_SHIFT           (25U)
#define BCTU_FIFOCR_DMA_EN_FIFO2_WIDTH           (1U)
#define BCTU_FIFOCR_DMA_EN_FIFO2(x)              (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOCR_DMA_EN_FIFO2_SHIFT)) & BCTU_FIFOCR_DMA_EN_FIFO2_MASK)
/*! @} */

/*! @name FIFOWM - FIFO Watermark Configuration */
/*! @{ */

#define BCTU_FIFOWM_WM_FIFO1_MASK                (0xFU)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */
#define BCTU_FIFOWM_WM_FIFO1_SHIFT               (0U)
#define BCTU_FIFOWM_WM_FIFO1_WIDTH               (4U)
#define BCTU_FIFOWM_WM_FIFO1(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOWM_WM_FIFO1_SHIFT)) & BCTU_FIFOWM_WM_FIFO1_MASK)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */

#define BCTU_FIFOWM_WM_FIFO2_MASK                (0x700U)
#define BCTU_FIFOWM_WM_FIFO2_SHIFT               (8U)
#define BCTU_FIFOWM_WM_FIFO2_WIDTH               (3U)
#define BCTU_FIFOWM_WM_FIFO2(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOWM_WM_FIFO2_SHIFT)) & BCTU_FIFOWM_WM_FIFO2_MASK)
/*! @} */

/*! @name FIFOERR - FIFO Error/Status */
/*! @{ */

#define BCTU_FIFOERR_WM_INT_FIFO1_MASK           (0x10000U)
#define BCTU_FIFOERR_WM_INT_FIFO1_SHIFT          (16U)
#define BCTU_FIFOERR_WM_INT_FIFO1_WIDTH          (1U)
#define BCTU_FIFOERR_WM_INT_FIFO1(x)             (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOERR_WM_INT_FIFO1_SHIFT)) & BCTU_FIFOERR_WM_INT_FIFO1_MASK)

