zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_BCTU.h
#define BCTU_FIFOERR_WM_INT_FIFO2_MASK           (0x20000U)
#define BCTU_FIFOERR_WM_INT_FIFO2_SHIFT          (17U)
#define BCTU_FIFOERR_WM_INT_FIFO2_WIDTH          (1U)
#define BCTU_FIFOERR_WM_INT_FIFO2(x)             (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOERR_WM_INT_FIFO2_SHIFT)) & BCTU_FIFOERR_WM_INT_FIFO2_MASK)

#define BCTU_FIFOERR_OVR_ERR_FIFO1_MASK          (0x1000000U)
#define BCTU_FIFOERR_OVR_ERR_FIFO1_SHIFT         (24U)
#define BCTU_FIFOERR_OVR_ERR_FIFO1_WIDTH         (1U)
#define BCTU_FIFOERR_OVR_ERR_FIFO1(x)            (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOERR_OVR_ERR_FIFO1_SHIFT)) & BCTU_FIFOERR_OVR_ERR_FIFO1_MASK)

#define BCTU_FIFOERR_UNDR_ERR_FIFO1_MASK         (0x2000000U)
#define BCTU_FIFOERR_UNDR_ERR_FIFO1_SHIFT        (25U)
#define BCTU_FIFOERR_UNDR_ERR_FIFO1_WIDTH        (1U)
#define BCTU_FIFOERR_UNDR_ERR_FIFO1(x)           (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOERR_UNDR_ERR_FIFO1_SHIFT)) & BCTU_FIFOERR_UNDR_ERR_FIFO1_MASK)

#define BCTU_FIFOERR_OVR_ERR_FIFO2_MASK          (0x4000000U)
#define BCTU_FIFOERR_OVR_ERR_FIFO2_SHIFT         (26U)
#define BCTU_FIFOERR_OVR_ERR_FIFO2_WIDTH         (1U)
#define BCTU_FIFOERR_OVR_ERR_FIFO2(x)            (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOERR_OVR_ERR_FIFO2_SHIFT)) & BCTU_FIFOERR_OVR_ERR_FIFO2_MASK)

#define BCTU_FIFOERR_UNDR_ERR_FIFO2_MASK         (0x8000000U)
#define BCTU_FIFOERR_UNDR_ERR_FIFO2_SHIFT        (27U)
#define BCTU_FIFOERR_UNDR_ERR_FIFO2_WIDTH        (1U)
#define BCTU_FIFOERR_UNDR_ERR_FIFO2(x)           (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOERR_UNDR_ERR_FIFO2_SHIFT)) & BCTU_FIFOERR_UNDR_ERR_FIFO2_MASK)
/*! @} */

/*! @name FIFOSR - FIFO Status */
/*! @{ */

#define BCTU_FIFOSR_FULL_FIFO1_MASK              (0x1U)
#define BCTU_FIFOSR_FULL_FIFO1_SHIFT             (0U)
#define BCTU_FIFOSR_FULL_FIFO1_WIDTH             (1U)
#define BCTU_FIFOSR_FULL_FIFO1(x)                (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOSR_FULL_FIFO1_SHIFT)) & BCTU_FIFOSR_FULL_FIFO1_MASK)

#define BCTU_FIFOSR_FULL_FIFO2_MASK              (0x2U)
#define BCTU_FIFOSR_FULL_FIFO2_SHIFT             (1U)
#define BCTU_FIFOSR_FULL_FIFO2_WIDTH             (1U)
#define BCTU_FIFOSR_FULL_FIFO2(x)                (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOSR_FULL_FIFO2_SHIFT)) & BCTU_FIFOSR_FULL_FIFO2_MASK)
/*! @} */

/*! @name FIFOCNTR - FIFO Counter */
/*! @{ */

#define BCTU_FIFOCNTR_CNTR_FIFO1_MASK            (0x1FU)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */
#define BCTU_FIFOCNTR_CNTR_FIFO1_SHIFT           (0U)
#define BCTU_FIFOCNTR_CNTR_FIFO1_WIDTH           (5U)
#define BCTU_FIFOCNTR_CNTR_FIFO1(x)              (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOCNTR_CNTR_FIFO1_SHIFT)) & BCTU_FIFOCNTR_CNTR_FIFO1_MASK)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */

#define BCTU_FIFOCNTR_CNTR_FIFO2_MASK            (0xF00U)
#define BCTU_FIFOCNTR_CNTR_FIFO2_SHIFT           (8U)
#define BCTU_FIFOCNTR_CNTR_FIFO2_WIDTH           (4U)
#define BCTU_FIFOCNTR_CNTR_FIFO2(x)              (((uint32_t)(((uint32_t)(x)) << BCTU_FIFOCNTR_CNTR_FIFO2_SHIFT)) & BCTU_FIFOCNTR_CNTR_FIFO2_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group BCTU_Register_Masks */

/*!
 * @}
 */ /* end of group BCTU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_BCTU_H_) */
